oldprogram/nRF51822/All_Function_Project/Board/pca10001/s110/ble_app_xcase/main.c
static void sys_evt_dispatch(uint32_t sys_evt);

static void system_off_mode_enter(void);
/*****************************************************************************
* Error Handling Functions
*****************************************************************************/


/**@brief Function for error handling, which is called when an error has occurred.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of error.
 *
 * @param[in] error_code  Error code supplied to the handler.
 * @param[in] line_num    Line number where the handler is called.
 * @param[in] p_file_name Pointer to the file name.
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t *p_file_name)
{
    // This call can be used for debug purposes during application development.
    // @note CAUTION: Activating this code will write the stack to flash on an error.
    //                This function should NOT be used in a final product.
    //                It is intended STRICTLY for development/debugging purposes.
    //                The flash write will happen EVEN if the radio is active, thus interrupting
    //                any communication.
    //                Use with care. Un-comment the line below to use.
    // ble_debug_assert_handler(error_code, line_num, p_file_name);

    // On assert, the system can only recover with a reset.
    NVIC_SystemReset();
}


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling a Bond Manager error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void bond_manager_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/*****************************************************************************
* Static Timeout Handling Functions
*****************************************************************************/

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *          This function will start the ADC.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void *p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_start();
}


/**@brief Function for handling the Heart rate measurement timer timeout.
 *
 * @details This function will be called each time the heart rate measurement timer expires.
 *          It will exclude RR Interval data from every third measurement.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void heart_rate_meas_timeout_handler(void *p_context)
{
    ;
#if 0
    uint32_t err_code;

    UNUSED_PARAMETER(p_context);

    err_code = ble_hrs_heart_rate_measurement_send(&m_hrs, m_cur_heart_rate);

    if (
        (err_code != NRF_SUCCESS)
        &&
        (err_code != NRF_ERROR_INVALID_STATE)
        &&
        (err_code != BLE_ERROR_NO_TX_BUFFERS)
        &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    )
    {
        APP_ERROR_HANDLER(err_code);
    }
#endif
}

static void sensor_state_chg_handler(void )
{
    uint32_t err_code;

    err_code = ble_hrs_heart_rate_measurement_send(&m_hrs, m_cur_heart_rate);

    if (
        (err_code != NRF_SUCCESS)
        &&
        (err_code != NRF_ERROR_INVALID_STATE)
        &&
        (err_code != BLE_ERROR_NO_TX_BUFFERS)
        &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    )
    {
        APP_ERROR_HANDLER(err_code);
    }
}

#if defined(BT_WRITE_TEST)
void bt_write_loopback(uint16_t data)//at most 2 bytes
{
    uint32_t err_code;

    err_code = ble_hrs_heart_rate_measurement_send(&m_hrs, data);

    if (
        (err_code != NRF_SUCCESS)
        &&
        (err_code != NRF_ERROR_INVALID_STATE)
        &&
        (err_code != BLE_ERROR_NO_TX_BUFFERS)
        &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    )
    {
        APP_ERROR_HANDLER(err_code);
    }
}
#endif


/**@brief Function for handling hrs events.
 *
 * @param[in]   p_hrs   Idenitifies service instance.
 * @param[in]   p_evt   Identifies HRS event.
 */
static void hrs_event_handler(ble_hrs_t *p_hrs, ble_hrs_evt_t *p_evt)
{
    uint32_t err_code;

    switch(p_evt->evt_type)
    {
    case BLE_HRS_EVT_NOTIFICATION_ENABLED:     // Fall through
    case BLE_HRS_EVT_NOTIFICATION_DISABLED:

        // Try to store system attributes
        err_code = ble_bondmngr_sys_attr_store();
        if (err_code == NRF_SUCCESS)
        {
            // System attribute store successfully requested.
        }
        else if (err_code == NRF_ERROR_INVALID_STATE)
        {
            // System attributes already updated, cannot update again.
        }
        else
        {
            APP_ERROR_HANDLER(err_code);
        }

        break;
    default:
        break;
    }
}


/**@brief Function for handling button events.
 *
 * @param[in]   pin_no   The pin number of the button pressed.
 */
static void button_event_handler(uint8_t pin_no)
{
    uint32_t state_l = 1, state_r = 1, state_up = 1, state_down = 1; //
    uint16_t sensor_state = 0, sensor_tmp = 0;
    state_l = nrf_gpio_pin_read(SEN_LEFT);

    state_r = nrf_gpio_pin_read(SEN_RIGHT);
    state_up = nrf_gpio_pin_read(SEN_UP);
    state_down   = nrf_gpio_pin_read(SEN_DOWN);
    //nrf_gpio_pin_set(IND_LED);// any interrupt toggle LED
    sensor_tmp = (uint16_t)~(state_up | (state_r << 1) | (state_down << 2) | (state_l << 3));
    sensor_state = 0x000F & sensor_tmp;
    //nrf_gpio_pin_toggle(IND_LED);// any interrupt toggle LED
#if defined(LOCAL_TEST)
    //edge_dispband(sensor_state);
#endif
    switch (pin_no)
    {
    case SENSOR_BUTTON_PIN_LEFT :
    case SENSOR_BUTTON_PIN_RIGHT:
    case SENSOR_BUTTON_PIN_DOWN:
    case SENSOR_BUTTON_PIN_UP:
        DrawBand( sensor_state);
        m_cur_heart_rate = sensor_state;
        sensor_state_chg_handler();
        break;
#if 0
    case BONDMNGR_DELETE_BUTTON_PIN_NO://system off
        nrf_gpio_cfg_sense_input(BONDMNGR_DELETE_BUTTON_PIN_NO,
                                 BUTTON_PULL,
                                 NRF_GPIO_PIN_SENSE_LOW);

        system_off_mode_enter();
        break;
#endif
    default:
        APP_ERROR_HANDLER(pin_no);
        break;
    }
}


/*****************************************************************************
* Static Initialization Functions
*****************************************************************************/

/**@brief Function for the Timer initialization.
 *
* @details Initializes the timer module. This creates and starts application timers.
*/
static void timers_init(void)
{
    uint32_t err_code;

