oldprogram/nRF51822/All_Function_Project/Board/pca10001/s110/ble_app_xcase/main.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the Bond Manager initialization.
 */
static void bond_manager_init(void)
{
    uint32_t            err_code;
    ble_bondmngr_init_t bond_init_data;
    bool                bonds_delete;

    // Initialize persistent storage module.
    err_code = pstorage_init();
    APP_ERROR_CHECK(err_code);

    // Clear all bonded centrals if the Bonds Delete button is pushed
    err_code = app_button_is_pushed(BONDMNGR_DELETE_BUTTON_PIN_NO, &bonds_delete);
    APP_ERROR_CHECK(err_code);

    // Initialize the Bond Manager
    bond_init_data.flash_page_num_bond     = FLASH_PAGE_BOND;
    bond_init_data.flash_page_num_sys_attr = FLASH_PAGE_SYS_ATTR;
    bond_init_data.evt_handler             = NULL;
    bond_init_data.error_handler           = bond_manager_error_handler;
    bond_init_data.bonds_delete            = bonds_delete;

    err_code = ble_bondmngr_init(&bond_init_data);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, false);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GPIOTE module.
 */
static void gpiote_init(void)
{
    APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);
}

/**@brief Function for initializing the button module.
 */
static void buttons_init(void)
{
    // Configure HR_INC_BUTTON_PIN_NO and HR_DEC_BUTTON_PIN_NO as wake up buttons and also configure
    // for 'pull up' because the eval board does not have external pull up resistors connected to
    // the buttons.
    static app_button_cfg_t sensors[] =
    {
        {SENSOR_BUTTON_PIN_RIGHT, false, BUTTON_PULL, button_event_handler},
        {SENSOR_BUTTON_PIN_LEFT, false, BUTTON_PULL, button_event_handler},
        {SENSOR_BUTTON_PIN_UP, false, BUTTON_PULL, button_event_handler},
        {SENSOR_BUTTON_PIN_DOWN, false, BUTTON_PULL, button_event_handler}
    };
    static app_button_cfg_t button[] =
    {
        {BONDMNGR_DELETE_BUTTON_PIN_NO, false, BUTTON_PULL, button_event_handler}
    };
    nrf_gpio_cfg_input(SEN_INT, NRF_GPIO_PIN_NOPULL);
    nrf_gpio_cfg_input(BONDMNGR_DELETE_BUTTON_PIN_NO, NRF_GPIO_PIN_NOPULL);
    //nrf_gpio_cfg_output(SEN_INT);
    //nrf_gpio_pin_clear(SEN_INT);// disable the int pin
    //nrf_gpio_cfg_output(BONDMNGR_DELETE_BUTTON_PIN_NO);
    //nrf_gpio_pin_set(BONDMNGR_DELETE_BUTTON_PIN_NO);// disable the on_off pin
    nrf_gpio_cfg_output(SEN_POWER_EN);
    SENSOR_Enable_POWER;//enable after phone sends ON cmd
    APP_BUTTON_INIT(sensors, sizeof(sensors) / sizeof(sensors[0]), SENSOR_DETECTION_DELAY, false);
    //APP_BUTTON_INIT(button, sizeof(button) / sizeof(button[0]), BUTTON_DETECTION_DELAY, false);
}


/*****************************************************************************
* Static Start Functions
*****************************************************************************/

/**@brief Function for starting the application timers.
 */
static void application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers
    err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_heart_rate_timer_id, HEART_RATE_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code;

    err_code = sd_ble_gap_adv_start(&m_adv_params);
    APP_ERROR_CHECK(err_code);

    led_start();
}


/**@brief Function for putting the chip in System OFF Mode
 */
static void system_off_mode_enter(void)
{
    uint32_t err_code;
    nrf_gpio_pin_set(IND_LED);
    //SENSOR_Disable_POWER;//disable sensor power
    SPIFlash_Disable_POWER;//disable flash power
    //disable screen power and blacklight
    LCD_Disable_POWER;
    LCD_BCKLIGHT_Disable_POWER;
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/*****************************************************************************
* Static Event Handling Functions
*****************************************************************************/

/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t *p_ble_evt)
{
    uint32_t        err_code;
    static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;

    switch (p_ble_evt->header.evt_id)
    {
    case BLE_GAP_EVT_CONNECTED:
        led_stop();

        m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

        // Initialize the current heart rate to the average of max and min values. So that
        // everytime a new connection is made, the heart rate starts from the same value.
        m_cur_heart_rate = 0;//(MAX_HEART_RATE + MIN_HEART_RATE) / 2;

        // Start timers used to generate battery and HR measurements.
        application_timers_start();

        // Start handling button presses
        err_code = app_button_enable();
        APP_ERROR_CHECK(err_code);
        break;

    case BLE_GAP_EVT_DISCONNECTED:
        // Since we are not in a connection and have not started advertising, store bonds
        err_code = ble_bondmngr_bonded_centrals_store();
        APP_ERROR_CHECK(err_code);

        // @note Flash access may not be complete on return of this API. System attributes are now
        // stored to flash when they are updated to ensure flash access on disconnect does not
        // result in system powering off before data was successfully written.

        // Go to system-off mode, should not return from this function, wakeup will trigger
        // a reset.
        system_off_mode_enter();
        break;

    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        err_code = sd_ble_gap_sec_params_reply(m_conn_handle,
                                               BLE_GAP_SEC_STATUS_SUCCESS,
                                               &m_sec_params);
        APP_ERROR_CHECK(err_code);
        break;

