oldprogram/nRF51822/All_Function_Project/Board/pca10001/s110/ble_app_xcase/main.c
    case BLE_GAP_EVT_TIMEOUT:
        if (p_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_ADVERTISEMENT)
        {
            led_stop();

            nrf_gpio_cfg_sense_input(SENSOR_BUTTON_PIN_RIGHT,
                                     BUTTON_PULL,
                                     NRF_GPIO_PIN_SENSE_LOW);

            nrf_gpio_cfg_sense_input(SENSOR_BUTTON_PIN_LEFT,
                                     BUTTON_PULL,
                                     NRF_GPIO_PIN_SENSE_LOW);
            nrf_gpio_cfg_sense_input(SENSOR_BUTTON_PIN_UP,
                                     BUTTON_PULL,
                                     NRF_GPIO_PIN_SENSE_LOW);

            nrf_gpio_cfg_sense_input(SENSOR_BUTTON_PIN_DOWN,
                                     BUTTON_PULL,
                                     NRF_GPIO_PIN_SENSE_LOW);

            system_off_mode_enter();
        }
        break;

    default:
        // No implementation needed.
        break;
    }
}


/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the BLE Stack event interrupt handler after a BLE stack
 *          event has been received.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t *p_ble_evt)
{
    ble_bondmngr_on_ble_evt(p_ble_evt);
    ble_hrs_on_ble_evt(&m_hrs, p_ble_evt);
    ble_bas_on_ble_evt(&bas, p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
    on_ble_evt(p_ble_evt);
}


/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in]   sys_evt   System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    pstorage_sys_event_handler(sys_evt);
}

static void idle_pin_config(void)
{
    nrf_gpio_cfg_output(S_IO_0);
    nrf_gpio_pin_clear(S_IO_0);
    nrf_gpio_cfg_output(S_IO_1);
    nrf_gpio_pin_clear(S_IO_1);
}
/*****************************************************************************
* Main Function
*****************************************************************************/

/**@brief Function for the application main entry.
 */
int main(void)
{
#if 0
    led_init();
    for(;;)
    {
        nrf_gpio_pin_set(IND_LED);
        nrf_delay_ms(10);
        nrf_gpio_pin_clear(IND_LED);
        nrf_delay_ms(100);
    }
#endif
#if 1
    uint32_t err_code;
    //nrf_delay_ms(1000);

    LCD_Init();

    idle_pin_config();

    timers_init();
    gpiote_init();
    led_init();
    buttons_init();
    //	  LCD_Init(); //
    Spi_Flash_Init();
    //Screen_show();
    sensor_healthy_state = 4;//check if sensors are healthy
    //sensor_init();
    ble_stack_init();
    bond_manager_init();

    // Initialize Bluetooth Stack parameters
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();
    sec_params_init();

#if 0//defined(FLASH_TEST)
    Spi_Flash_test();
#endif
    // Start advertising
    //	DispColor(RED);
    advertising_start();
    // Enter main loop

	Spi_Flash_test();

    for (;;)
    {
        // Switch to a low power state until an event is available for the application
        //Screen_show();
        err_code = sd_app_evt_wait();
        APP_ERROR_CHECK(err_code);
    }
#endif
}

/**
 * @}
 */
